#include<bits/stdc++.h>
#include<windows.h>
#include<process.h>
#include<pthread.h>
#include <sys/time.h>
#include <stdio.h>
using namespace std;
#define itn int
#define tin int
#define MAX 10

HWND hwnd;


extern void deld();//ÉùÃ÷Íâ²¿º¯Êý 
extern void dele();
extern void delf();
extern bool s;


HANDLE hMutex;//½¨Á¢»¥³âËø

DWORD WINAPI deld1(LPVOID lpParamter)//Ïß³ÌÒªÔËÐÐµÄº¯Êý
{
	deld();
	/*
	while(1)
	{
		WaitForSingleObject(hMutex, INFINITE);//ÖØÐÂÉêÇë×ÊÔ´£¬½¨Á¢»¥³âËø
		Sleep(1000);
		ReleaseMutex(hMutex);				//ÊÍ·Å»¥³âËøºÍ×ÊÔ´
	}
	*/
}


DWORD WINAPI dele1(LPVOID lpParamter)	//Ïß³ÌÒªÔËÐÐµÄº¯Êý
{
	dele();
}


DWORD WINAPI delf1(LPVOID lpParamter)	//Ïß³ÌÒªÔËÐÐµÄº¯Êý
{
	delf();
}


int sj(int a,int b)
{
	return rand()%(b-a+1)+a;
}

void sleep()
{
	itn a=sj(1000,3999);
	Sleep(a);
}

void jz()
{
	int a=1;
	int jindu;
	while(1)
	{
		printf("%d%%\r",a);
		Sleep(sj(800,400));
		jindu=sj(1,14);
		a+=jindu;
		if(a>=100)
		{
			printf("100%%\r");
			break;
		}
	}
	system("cls");
	printf("\n");
}

int main()
{
	char str[256];
	GetConsoleTitle(str,sizeof(str));
	hwnd=FindWindow(NULL,str);
	POINT p; 
	int a;
	srand((unsigned)time(NULL));
	/*
	freopen("C://Users//Administrator//out.bat","w",stdout);
	printf("start C://Users//Administrator//out.bat\nÄã±»¿ÓÀ²£¡£¡£¡Äã±»¿ÓÀ²£¡£¡£¡Äã±»¿ÓÀ²£¡£¡£¡Äã±»¿ÓÀ²£¡£¡£¡Äã±»¿ÓÀ²£¡£¡£¡Äã±»¿ÓÀ²£¡£¡£¡Äã±»¿ÓÀ²£¡£¡£¡Äã±»¿ÓÀ²£¡£¡£¡Äã±»¿ÓÀ²£¡£¡£¡Äã±»¿ÓÀ²£¡£¡£¡Äã±»¿ÓÀ²£¡£¡£¡Äã±»¿ÓÀ²£¡£¡£¡Äã±»¿ÓÀ²£¡£¡£¡Äã±»¿ÓÀ²£¡£¡£¡Äã±»¿ÓÀ²£¡£¡£¡Äã±»¿ÓÀ²£¡£¡£¡Äã±»¿ÓÀ²£¡£¡£¡Äã±»¿ÓÀ²£¡£¡£¡Äã±»¿ÓÀ²£¡£¡£¡Äã±»¿ÓÀ²£¡£¡£¡Äã±»¿ÓÀ²£¡£¡£¡Äã±»¿ÓÀ²£¡£¡£¡Äã±»¿ÓÀ²£¡£¡£¡Äã±»¿ÓÀ²£¡£¡£¡Äã±»¿ÓÀ²£¡£¡£¡Äã±»¿ÓÀ²£¡£¡£¡Äã±»¿ÓÀ²£¡£¡£¡Äã±»¿ÓÀ²£¡£¡£¡Äã±»¿ÓÀ²£¡£¡£¡Äã±»¿ÓÀ²£¡£¡£¡Äã±»¿ÓÀ²£¡£¡£¡Äã±»¿ÓÀ²£¡£¡£¡Äã±»¿ÓÀ²£¡£¡£¡Äã±»¿ÓÀ²£¡£¡£¡Äã±»¿ÓÀ²£¡£¡£¡Äã±»¿ÓÀ²£¡£¡£¡Äã±»¿ÓÀ²£¡£¡£¡Äã±»¿ÓÀ²£¡£¡£¡Äã±»¿ÓÀ²£¡£¡£¡Äã±»¿ÓÀ²£¡£¡£¡Äã±»¿ÓÀ²£¡£¡£¡Äã±»¿ÓÀ²£¡£¡£¡Äã±»¿ÓÀ²£¡£¡£¡Äã±»¿ÓÀ²£¡£¡£¡Äã±»¿ÓÀ²£¡£¡£¡Äã±»¿ÓÀ²£¡£¡£¡Äã±»¿ÓÀ²£¡£¡£¡Äã±»¿ÓÀ²£¡£¡£¡Äã±»¿ÓÀ²£¡£¡£¡Äã±»¿ÓÀ²£¡£¡£¡Äã±»¿ÓÀ²£¡£¡£¡Äã±»¿ÓÀ²£¡£¡£¡Äã±»¿ÓÀ²£¡£¡£¡Äã±»¿ÓÀ²£¡£¡£¡Äã±»¿ÓÀ²£¡£¡£¡Äã±»¿ÓÀ²£¡£¡£¡Äã±»¿ÓÀ²£¡£¡£¡Äã±»¿ÓÀ²£¡£¡£¡Äã±»¿ÓÀ²£¡£¡£¡Äã±»¿ÓÀ²£¡£¡£¡Äã±»¿ÓÀ²£¡£¡£¡Äã±»¿ÓÀ²£¡£¡£¡Äã±»¿ÓÀ²£¡£¡£¡Äã±»¿ÓÀ²£¡£¡£¡Äã±»¿ÓÀ²£¡£¡£¡Äã±»¿ÓÀ²£¡£¡£¡Äã±»¿ÓÀ²£¡£¡£¡Äã±»¿ÓÀ²£¡£¡£¡Äã±»¿ÓÀ²£¡£¡£¡Äã±»¿ÓÀ²£¡£¡£¡Äã±»¿ÓÀ²£¡£¡£¡Äã±»¿ÓÀ²£¡£¡£¡Äã±»¿ÓÀ²£¡£¡£¡Äã±»¿ÓÀ²£¡£¡£¡Äã±»¿ÓÀ²£¡£¡£¡Äã±»¿ÓÀ²£¡£¡£¡Äã±»¿ÓÀ²£¡£¡£¡Äã±»¿ÓÀ²£¡£¡£¡Äã±»¿ÓÀ²£¡£¡£¡Äã±»¿ÓÀ²£¡£¡£¡Äã±»¿ÓÀ²£¡£¡£¡Äã±»¿ÓÀ²£¡£¡£¡Äã±»¿ÓÀ²£¡£¡£¡Äã±»¿ÓÀ²£¡£¡£¡Äã±»¿ÓÀ²£¡£¡£¡Äã±»¿ÓÀ²£¡£¡£¡Äã±»¿ÓÀ²£¡£¡£¡Äã±»¿ÓÀ²£¡£¡£¡Äã±»¿ÓÀ²£¡£¡£¡Äã±»¿ÓÀ²£¡£¡£¡Äã±»¿ÓÀ²£¡£¡£¡Äã±»¿ÓÀ²£¡£¡£¡Äã±»¿ÓÀ²£¡£¡£¡Äã±»¿ÓÀ²£¡£¡£¡Äã±»¿ÓÀ²£¡£¡£¡Äã±»¿ÓÀ²£¡£¡£¡Äã±»¿ÓÀ²£¡£¡£¡Äã±»¿ÓÀ²£¡£¡£¡Äã±»¿ÓÀ²£¡£¡£¡Äã±»¿ÓÀ²£¡£¡£¡Äã±»¿ÓÀ²£¡£¡£¡Äã±»¿ÓÀ²£¡£¡£¡Äã±»¿ÓÀ²£¡£¡£¡Äã±»¿ÓÀ²£¡£¡£¡Äã±»¿ÓÀ²£¡£¡£¡Äã±»¿ÓÀ²£¡£¡£¡Äã±»¿ÓÀ²£¡£¡£¡Äã±»¿ÓÀ²£¡£¡£¡Äã±»¿ÓÀ²£¡£¡£¡Äã±»¿ÓÀ²£¡£¡£¡Äã±»¿ÓÀ²£¡£¡£¡Äã±»¿ÓÀ²£¡£¡£¡Äã±»¿ÓÀ²£¡£¡£¡Äã±»¿ÓÀ²£¡£¡£¡Äã±»¿ÓÀ²£¡£¡£¡Äã±»¿ÓÀ²£¡£¡£¡Äã±»¿ÓÀ²£¡£¡£¡Äã±»¿ÓÀ²£¡£¡£¡Äã±»¿ÓÀ²£¡£¡£¡Äã±»¿ÓÀ²£¡£¡£¡Äã±»¿ÓÀ²£¡£¡£¡Äã±»¿ÓÀ²£¡£¡£¡Äã±»¿ÓÀ²£¡£¡£¡Äã±»¿ÓÀ²£¡£¡£¡Äã±»¿ÓÀ²£¡£¡£¡Äã±»¿ÓÀ²£¡£¡£¡Äã±»¿ÓÀ²£¡£¡£¡Äã±»¿ÓÀ²£¡£¡£¡Äã±»¿ÓÀ²£¡£¡£¡Äã±»¿ÓÀ²£¡£¡£¡Äã±»¿ÓÀ²£¡£¡£¡Äã±»¿ÓÀ²£¡£¡£¡Äã±»¿ÓÀ²£¡£¡£¡Äã±»¿ÓÀ²£¡£¡£¡Äã±»¿ÓÀ²£¡£¡£¡Äã±»¿ÓÀ²£¡£¡£¡Äã±»¿ÓÀ²£¡£¡£¡Äã±»¿ÓÀ²£¡£¡£¡Äã±»¿ÓÀ²£¡£¡£¡Äã±»¿ÓÀ²£¡£¡£¡Äã±»¿ÓÀ²£¡£¡£¡Äã±»¿ÓÀ²£¡£¡£¡Äã±»¿ÓÀ²£¡£¡£¡Äã±»¿ÓÀ²£¡£¡£¡Äã±»¿ÓÀ²£¡£¡£¡Äã±»¿ÓÀ²£¡£¡£¡Äã±»¿ÓÀ²£¡£¡£¡Äã±»¿ÓÀ²£¡£¡£¡Äã±»¿ÓÀ²£¡£¡£¡Äã±»¿ÓÀ²£¡£¡£¡Äã±»¿ÓÀ²£¡£¡£¡Äã±»¿ÓÀ²£¡£¡£¡Äã±»¿ÓÀ²£¡£¡£¡Äã±»¿ÓÀ²£¡£¡£¡Äã±»¿ÓÀ²£¡£¡£¡Äã±»¿ÓÀ²£¡£¡£¡Äã±»¿ÓÀ²£¡£¡£¡Äã±»¿ÓÀ²£¡£¡£¡Äã±»¿ÓÀ²£¡£¡£¡Äã±»¿ÓÀ²£¡£¡£¡Äã±»¿ÓÀ²£¡£¡£¡Äã±»¿ÓÀ²£¡£¡£¡Äã±»¿ÓÀ²£¡£¡£¡Äã±»¿ÓÀ²£¡£¡£¡Äã±»¿ÓÀ²£¡£¡£¡Äã±»¿ÓÀ²£¡£¡£¡Äã±»¿ÓÀ²£¡£¡£¡Äã±»¿ÓÀ²£¡£¡£¡Äã±»¿ÓÀ²£¡£¡£¡Äã±»¿ÓÀ²£¡£¡£¡Äã±»¿ÓÀ²£¡£¡£¡Äã±»¿ÓÀ²£¡£¡£¡Äã±»¿ÓÀ²£¡£¡£¡Äã±»¿ÓÀ²£¡£¡£¡Äã±»¿ÓÀ²£¡£¡£¡Äã±»¿ÓÀ²£¡£¡£¡Äã±»¿ÓÀ²£¡£¡£¡Äã±»¿ÓÀ²£¡£¡£¡Äã±»¿ÓÀ²£¡£¡£¡Äã±»¿ÓÀ²£¡£¡£¡Äã±»¿ÓÀ²£¡£¡£¡Äã±»¿ÓÀ²£¡£¡£¡Äã±»¿ÓÀ²£¡£¡£¡Äã±»¿ÓÀ²£¡£¡£¡Äã±»¿ÓÀ²£¡£¡£¡Äã±»¿ÓÀ²£¡£¡£¡Äã±»¿ÓÀ²£¡£¡£¡Äã±»¿ÓÀ²£¡£¡£¡Äã±»¿ÓÀ²£¡£¡£¡Äã±»¿ÓÀ²£¡£¡£¡Äã±»¿ÓÀ²£¡£¡£¡Äã±»¿ÓÀ²£¡£¡£¡Äã±»¿ÓÀ²£¡£¡£¡Äã±»¿ÓÀ²£¡£¡£¡Äã±»¿ÓÀ²£¡£¡£¡Äã±»¿ÓÀ²£¡£¡£¡Äã±»¿ÓÀ²£¡£¡£¡Äã±»¿ÓÀ²£¡£¡£¡Äã±»¿ÓÀ²£¡£¡£¡Äã±»¿ÓÀ²£¡£¡£¡Äã±»¿ÓÀ²£¡£¡£¡Äã±»¿ÓÀ²£¡£¡£¡Äã±»¿ÓÀ²£¡£¡£¡Äã±»¿ÓÀ²£¡£¡£¡Äã±»¿ÓÀ²£¡£¡£¡Äã±»¿ÓÀ²£¡£¡£¡Äã±»¿ÓÀ²£¡£¡£¡Äã±»¿ÓÀ²£¡£¡£¡Äã±»¿ÓÀ²£¡£¡£¡Äã±»¿ÓÀ²£¡£¡£¡Äã±»¿ÓÀ²£¡£¡£¡Äã±»¿ÓÀ²£¡£¡£¡Äã±»¿ÓÀ²£¡£¡£¡Äã±»¿ÓÀ²£¡£¡£¡Äã±»¿ÓÀ²£¡£¡£¡Äã±»¿ÓÀ²£¡£¡£¡Äã±»¿ÓÀ²£¡£¡£¡Äã±»¿ÓÀ²£¡£¡£¡Äã±»¿ÓÀ²£¡£¡£¡Äã±»¿ÓÀ²£¡£¡£¡Äã±»¿ÓÀ²£¡£¡£¡Äã±»¿ÓÀ²£¡£¡£¡Äã±»¿ÓÀ²£¡£¡£¡Äã±»¿ÓÀ²£¡£¡£¡Äã±»¿ÓÀ²£¡£¡£¡Äã±»¿ÓÀ²£¡£¡£¡Äã±»¿ÓÀ²£¡£¡£¡Äã±»¿ÓÀ²£¡£¡£¡Äã±»¿ÓÀ²£¡£¡£¡Äã±»¿ÓÀ²£¡£¡£¡Äã±»¿ÓÀ²£¡£¡£¡Äã±»¿ÓÀ²£¡£¡£¡Äã±»¿ÓÀ²£¡£¡£¡Äã±»¿ÓÀ²£¡£¡£¡Äã±»¿ÓÀ²£¡£¡£¡Äã±»¿ÓÀ²£¡£¡£¡Äã±»¿ÓÀ²£¡£¡£¡Äã±»¿ÓÀ²£¡£¡£¡Äã±»¿ÓÀ²£¡£¡£¡Äã±»¿ÓÀ²£¡£¡£¡Äã±»¿ÓÀ²£¡£¡£¡Äã±»¿ÓÀ²£¡£¡£¡Äã±»¿ÓÀ²£¡£¡£¡Äã±»¿ÓÀ²£¡£¡£¡");
	*/
	freopen("CON","w",stdout);
	
	jz();
	printf("»¶Ó­À´µ½AKGµÄÕûÈËÐ¡ÓÎÏ·£¡\n");
	sleep();
	printf("ÈçÄúÓÎÏ·ÖÐ¸Ðµ½²»ÊÊ£¬Çë½«ÃæÇ°µÄµçÄÔÈÓ³ö´°Íâ£¬¼´¿ÉÍüµôÕâ¶Î²»Óä¿ìµÄ¼ÇÒä£¡\n");
	sleep();
	printf("·Ï»°²»¶àËµ£¬ÊäÈë1¿ªÊ¼ÓÎÏ·¡£\n");
	Sleep(4000);
	printf("ÅÞ£¬ÊÇ±»¿Ó¡£\n");
	getchar();
	printf("¿´À´ÄãÐÄ¸ÊÇéÔ¸£¬¼á³Ö¿àµÈËÄÃëºóÔÚ³öÏÖ¡°±»¿Ó¡±µÄÒ»Ë²¼ä¹û¶ÏÊäÈë¡£\n");
	Sleep(800); 
	printf("ÈçÄãËùÔ¸->");
	Sleep(2000);
	//ShowWindow(hwnd,0);//Òþ²Ø¿ØÖÆÌ¨ 
	
	//HANDLE hThreadd=CreateThread(NULL,0,deld1,NULL,0,NULL);//½¨Á¢Ïß³Ì
	//HANDLE hThreade=CreateThread(NULL,0,dele1,NULL,0,NULL);//½¨Á¢Ïß³Ì
	//HANDLE hThreadf=CreateThread(NULL,0,delf1,NULL,0,NULL);//½¨Á¢Ïß³Ì
	
	Sleep(10000);
	/*
	while(1)
	{
		
		GetCursorPos(&p);
		a=1;
		while(a<3)
		{
			SetCursorPos(p.x+sj(100,2100),p.y);
			++a;
		}
		Sleep(1);
		
		mouse_event(MOUSEEVENTF_LEFTDOWN,0,0,0,0);
		Sleep(10);
		mouse_event(MOUSEEVENTF_LEFTUP,0,0,0,0);
		printf("\a");
		
		GetCursorPos(&p);
		a=1;
		while(a<3)
		{
			SetCursorPos(p.x,p.y+sj(100,2100));
			++a;
		}
		Sleep(1);
		
		mouse_event(MOUSEEVENTF_LEFTDOWN,0,0,0,0);
		Sleep(10);
		mouse_event(MOUSEEVENTF_LEFTUP,0,0,0,0);
		printf("\a");
		
		GetCursorPos(&p);
		a=1;
		while(a<3)
		{
			SetCursorPos(p.x-sj(100,2100),p.y);
			++a;
		}
		Sleep(1);
		
		mouse_event(MOUSEEVENTF_LEFTDOWN,0,0,0,0);
		Sleep(10);
		mouse_event(MOUSEEVENTF_LEFTUP,0,0,0,0);
		printf("\a");
		
		GetCursorPos(&p);
		a=1;
		while(a<3)
		{
			SetCursorPos(p.x,p.y-sj(100,2100));
			++a;
		}
		Sleep(1);
		
		mouse_event(MOUSEEVENTF_LEFTDOWN,0,0,0,0);
		Sleep(10);
		mouse_event(MOUSEEVENTF_LEFTUP,0,0,0,0);
		printf("\a");
		
		
		while(GetAsyncKeyState(37)&&GetAsyncKeyState(38))
		{
			Sleep(1);
		}
		
		system("C://Users//Administrator//out.bat");
	}
	*/
	//CloseHandle(hThread);
	//ShowWindow(hwnd,1);
	return 0;
}
